[
  {
    "id": "1",
    "title": "Getting Started with React",
    "content": "React is a powerful JavaScript library for building user interfaces. It uses a component-based architecture that makes it easy to build complex UIs from small, isolated pieces of code.",
    "status": "public",
    "createdAt": "2024-01-15T10:30:00Z"
  },
  {
    "id": "2",
    "title": "Introduction to Material UI",
    "content": "Material UI is a popular React UI framework that implements Google's Material Design. It provides pre-built components that are customizable and accessible.",
    "status": "public",
    "createdAt": "2024-01-20T14:45:00Z"
  },
  {
    "id": "3",
    "title": "Understanding React Hooks",
    "content": "React Hooks are functions that let you use state and other React features in functional components. The most common hooks are useState and useEffect.",
    "status": "unpublic",
    "createdAt": "2024-02-05T09:15:00Z"
  },
  {
    "id": "4",
    "title": "Building Forms in React",
    "content": "Forms are an essential part of web applications. In React, you can build controlled components that manage form state effectively using hooks.",
    "status": "public",
    "createdAt": "2024-02-12T11:20:00Z"
  },
  {
    "id": "5",
    "title": "React Router Guide",
    "content": "React Router is a standard library for routing in React applications. It enables navigation between different views and handles URL parameters seamlessly.",
    "status": "unpublic",
    "createdAt": "2024-02-18T16:00:00Z"
  },
  {
    "id": "6",
    "title": "State Management in React",
    "content": "Managing state effectively is crucial for building scalable React applications. You can use Context API, Redux, or other state management libraries.",
    "status": "public",
    "createdAt": "2024-03-01T08:30:00Z"
  },
  {
    "id": "7",
    "title": "React Performance Optimization",
    "content": "Optimizing React applications involves techniques like memoization, code splitting, lazy loading, and avoiding unnecessary re-renders.",
    "status": "public",
    "createdAt": "2024-03-10T13:45:00Z"
  },
  {
    "id": "8",
    "title": "Testing React Components",
    "content": "Testing is vital for maintaining code quality. React Testing Library and Jest are popular tools for testing React components effectively.",
    "status": "unpublic",
    "createdAt": "2024-03-15T10:00:00Z"
  }
]
